{"files":"Include a list of files. This does not support glob patterns, as opposed to `include`.","extends":"Specify one or more path or node module references to base configuration files from which settings are inherited.","include":"Specify a list of modules which to acquire types for.","exclude":"Specify a list of modules which to exclude from type acquisition.","references":"Specify an array of objects that specify paths for projects. Used in project references.","allowUnreachableCode":"Visualizza un errore quando il codice non verrà mai eseguito","allowUnusedLabels":"Visualizza un errore quando un'etichetta viene creata accidentalmente","alwaysStrict":"Assicura che 'use strict' sia sempre inserito all'inizio del file","exactOptionalPropertyTypes":"Differentiate between undefined and not present when type checking","noFallthroughCasesInSwitch":"Enable error reporting for fallthrough cases in switch statements.","noImplicitAny":"Enable error reporting for expressions and declarations with an implied `any` type..","noImplicitOverride":"Ensure overriding members in derived classes are marked with an override modifier.","noImplicitReturns":"Enable error reporting for codepaths that do not explicitly return in a function.","noImplicitThis":"Enable error reporting when `this` is given the type `any`.","noPropertyAccessFromIndexSignature":"Enforces using indexed accessors for keys declared using an indexed type","noUncheckedIndexedAccess":"Add `undefined` to a type when accessed using an index.","noUnusedLocals":"Enable error reporting when a local variables aren't read.","noUnusedParameters":"Raise an error when a function parameter isn't read","strict":"Enable all strict type checking options.","strictBindCallApply":"Check that the arguments for `bind`, `call`, and `apply` methods match the original function.","strictFunctionTypes":"When assigning functions, check to ensure parameters and the return values are subtype-compatible.","strictNullChecks":"When type checking, take into account `null` and `undefined`.","strictPropertyInitialization":"Check for class properties that are declared but not set in the constructor.","useUnknownInCatchVariables":"Default catch clause variables as `unknown` instead of `any`.","allowUmdGlobalAccess":"Rende tutte le importazioni UMD disponibili globalmente","baseUrl":"Imposta un URL di base per i nomi dei moduli relativi","module":"Definisce il sistema di moduli previsto per il runtime","moduleResolution":"Specify how TypeScript looks up a file from a given module specifier.","noResolve":"Disallow `import`s, `require`s or `<reference>`s from expanding the number of files TypeScript should add to a project.","paths":"Specify a set of entries that re-map imports to additional lookup locations.","resolveJsonModule":"Enable importing .json files","rootDir":"Definizione della cartella di root e delle sue impostazioni","rootDirs":"Allow multiple folders to be treated as one when resolving modules.","typeRoots":"Specify multiple folders that act like `./node_modules/@types`.","types":"Specify type package names to be included without being referenced in a source file.","declaration":"Creazione di file d.ts per gestire le importazioni di un progetto","declarationDir":"Definisce la directory principale per i file .d.ts","declarationMap":"Crea una source map per tutti i file .d.ts","downlevelIteration":"Emette Javascript compatibile e più dettagliato per oggetti iterativi","emitBOM":"Emit a UTF-8 Byte Order Mark (BOM) in the beginning of output files.","emitDeclarationOnly":"Only output d.ts files and not JavaScript files.","importHelpers":"Permette di importare alcune funzioni ausiliari per il progetto","importsNotUsedAsValues":"Specify emit/checking behavior for imports that are only used for types.","inlineSourceMap":"Include sourcemap files inside the emitted JavaScript.","inlineSources":"Include source code in the sourcemaps inside the emitted JavaScript.","mapRoot":"Specify the location where debugger should locate map files instead of generated locations.","newLine":"Set the newline character for emitting files.","noEmit":"Non genera file da una compilazione","noEmitHelpers":"Disable generating custom helper functions like `__extends` in compiled output.","noEmitOnError":"Disable emitting files if any type checking errors are reported.","outDir":"Imposta una directory di output per tutti i file generati.","outFile":"Crea un solo file js che contiene tutti i file concatenati","preserveConstEnums":"Disable erasing `const enum` declarations in generated code.","removeComments":"Rimuove commenti di TypeScript in modo da non venire visualizzati in JavaScript","sourceMap":"Source Map del codice JavaScript generato","sourceRoot":"Specify the root path for debuggers to find the reference source code.","stripInternal":"Disable emitting declarations that have `@internal` in their JSDoc comments.","allowJs":"Consentire di importare i file .js","checkJs":"Eseguire o verificare i tipi nel file .js del progetto","maxNodeModuleJsDepth":"Specify the maximum folder depth used for checking JavaScript files from `node_modules`. Only applicable with `allowJs`.","disableSizeLimit":"Rimuove la limitazione della memoria sul server di linguaggio TypeScript","plugins":"La lista dei plugin inclusi nel codice","allowSyntheticDefaultImports":"Permette di importare un modulo x da un modulo y’ quando un modulo non ha un’esportazione standard","esModuleInterop":"Emit additional JavaScript to ease support for importing CommonJS modules. This enables `allowSyntheticDefaultImports` for type compatibility.","forceConsistentCasingInFileNames":"Ensure that casing is correct in imports.","isolatedModules":"Si assicura che ogni file possa essere compilato in sicurezza senza basarsi sulle altre importazioni","preserveSymlinks":"Disable resolving symlinks to their realpath. This correlates to the same flag in node.","charset":"Imposta manualmente la codifica del testo per la lettura dei file","keyofStringsOnly":"Make keyof only return strings instead of string, numbers or symbols. Legacy option.","noImplicitUseStrict":"Disable adding 'use strict' directives in emitted JavaScript files.","noStrictGenericChecks":"Disable strict checking of generic signatures in function types.","out":"Deprecated setting. Use `outFile` instead.","suppressExcessPropertyErrors":"Disable reporting of excess property errors during the creation of object literals.","suppressImplicitAnyIndexErrors":"Suppress `noImplicitAny` errors when indexing objects that lack index signatures.","emitDecoratorMetadata":"Emit design-type metadata for decorated declarations in source files.","experimentalDecorators":"Enable experimental support for TC39 stage 2 draft decorators.","jsx":"Controlla come viene emesso JSX","jsxFactory":"Specify the JSX factory function used when targeting React JSX emit, e.g. 'React.createElement' or 'h'","jsxFragmentFactory":"Specify the JSX Fragment reference used for fragments when targeting React JSX emit e.g. 'React.Fragment' or 'Fragment'.","jsxImportSource":"Specify module specifier used to import the JSX factory functions when using `jsx: react-jsx*`.`","lib":"Include le definizioni di disponibili nel runtime di JavaScript","noLib":"Disable including any library files, including the default lib.d.ts.","reactNamespace":"Specify the object invoked for `createElement`. This only applies when targeting `react` JSX emit.","target":"Imposta il runtime del linguaggio JavaScript supportato da compliare","useDefineForClassFields":"Emit ECMAScript-standard-compliant class fields.","diagnostics":"Genera più informazioni diagnostiche dopo la compilazione","explainFiles":"Print files read during the compilation including why it was included.","extendedDiagnostics":"Output more detailed compiler performance information after building.","generateCpuProfile":"Emit a v8 CPU profile of the compiler run for debugging.","listEmittedFiles":"Print the names of emitted files after a compilation.","listFiles":"Print all of the files read during the compilation.","traceResolution":"Log paths used during the `moduleResolution` process.","composite":"Usato per creare varie build dello stesso progetto","disableReferencedProjectLoad":"Riduce il numero di progetti caricati automaticamente da TypeScript","disableSolutionSearching":"Opt a project out of multi-project reference checking when editing.","disableSourceOfProjectReferenceRedirect":"Disable preferring source files instead of declaration files when referencing composite projects","incremental":"Crea dei file .tsbuildinfo per permettere la compilazione incrementale del progetto","tsBuildInfoFile":"Specifica la directory per le informazioni sulla compilazione incrementale .tsbuildinfo.","noErrorTruncation":"Disable truncating types in error messages.","preserveWatchOutput":"Disable wiping the console in watch mode","pretty":"Enable color and formatting in output to make compiler errors easier to read","skipDefaultLibCheck":"Skip type checking .d.ts files that are included with TypeScript.","skipLibCheck":"Skip type checking all .d.ts files.","assumeChangesOnlyAffectDirectDependencies":"Un'opzione della modalità watch che è drasticamente più veloce, ma a volte imprecisa","watchFile":"Specify how the TypeScript watch mode works.","watchDirectory":"Specify how directories are watched on systems that lack recursive file-watching functionality.","fallbackPolling":"Specify what approach the watcher should use if the system runs out of native file watchers.","synchronousWatchDirectory":"Synchronously call callbacks and update the state of directory watchers on platforms that don`t support recursive watching natively.","excludeDirectories":"Remove a list of directories from the watch process.","excludeFiles":"Remove a list of files from the watch mode's processing.","enable":"Disable the type acquisition for JavaScript projects","disableFilenameBasedTypeAcquisition":"Disables inference for type acquisition by looking at filenames in a project."}